app/views/alunos/show.html.erb

    <dt style="width: 110px;"><strong><%= model_class.human_attribute_name(:emprestimos) %>:</strong></dt>
    <% @aluno.emprestimos.each do |emprestimos|%>
---
SELECT "emprestimos".* FROM "emprestimos" WHERE "emprestimos"."aluno_id" = ?  [["aluno_id", 1]]