app/helpers/emprestimos_helper.rb

    def validar_dados(emprestimo)
        if !Aluno.where(matricula: emprestimo.matricula).exists?
            @error = "Matricula incorreta ou não cadastrada."
            true
        elsif !Livro.where(codigo: emprestimo.codigo).exists?
---
SELECT  1 AS one FROM "alunos" WHERE "alunos"."matricula" = ? LIMIT ?  [["matricula", 1059802], ["LIMIT", 1]]
SELECT  1 AS one FROM "livros" WHERE "livros"."codigo" = ? LIMIT ?  [["codigo", 9883251], ["LIMIT", 1]]

    def finalizar_dados(emprestimo)
         # Pesquisa no banco da dados aluno e livro com o numero da matricula do aluno e codigo do livro
         aluno = Aluno.where(matricula: @emprestimo.matricula).first
         livro = Livro.where(codigo: @emprestimo.codigo).first
---
SELECT  "alunos".* FROM "alunos" WHERE "alunos"."matricula" = ? ORDER BY "alunos"."id" ASC LIMIT ?  [["matricula", 1059802], ["LIMIT", 1]]
SELECT  "livros".* FROM "livros" WHERE "livros"."codigo" = ? ORDER BY "livros"."id" ASC LIMIT ?  [["codigo", 9883251], ["LIMIT", 1]]