app/controllers/alunos_controller.rb

  def destroy
    @aluno.destroy
---
DELETE FROM "alunos" WHERE "alunos"."id" = ?  [["id", 2]]

    def set_aluno
      @aluno = Aluno.find(params[:id])
---
SELECT  "alunos".* FROM "alunos" WHERE "alunos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]