app/controllers/alunos_controller.rb

SELECT  "alunos".* FROM "alunos" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "alunos"
---
  def index
    @alunos = Aluno.all.page params[:page]

SELECT  1 AS one FROM "alunos" WHERE "alunos"."matricula" = ? LIMIT ?  [["matricula", 1043700], ["LIMIT", 1]]
SELECT  1 AS one FROM "alunos" WHERE "alunos"."matricula" = ? LIMIT ?  [["matricula", 1059802], ["LIMIT", 1]]
UPDATE "alunos" SET "nome" = ?, "updated_at" = ? WHERE "alunos"."id" = ?  [["nome", "Lucas Pinheiro de Oliveira"], ["updated_at", "2018-06-06 13:42:42.237119"], ["id", 1]]
INSERT INTO "alunos" ("nome", "matricula", "email", "telefone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @aluno = Aluno.new(aluno_params)
    puts @aluno.matricula.digits.count
    puts @aluno.matricula.class

    respond_to do |format|
      #Verifica se todos os campos foram prenchido
      if @aluno.nome.empty? || @aluno.matricula.nil? || @aluno.email.empty? || @aluno.telefone.empty?
        format.html { redirect_to new_aluno_path, alert: "Todos os campos devem ser preenchido." }
        format.json { head :no_content }
      #Verifica se a matricula esta correta
      elsif @aluno.matricula.digits.count < 7
        format.html { redirect_to new_aluno_path, alert: "Matricula incorreta." }
        format.json { head :no_content }
      #Verifica se o aluno já esta cadastrado
      elsif Aluno.where(matricula: @aluno.matricula).exists?
        format.html { redirect_to new_aluno_path, alert: "Aluno já cadastrado no sistema." }
        format.json { head :no_content }
      else
        if @aluno.save

UPDATE "alunos" SET "nome" = ?, "matricula" = ?, "email" = ?, "telefone" = ?, "updated_at" = ? WHERE "alunos"."id" = ?  [["nome", "Sara Alves de Carvalho"], ["matricula", 1063265], ["email", "saraalvesdecarvalho19@gmail.com"], ["telefone", "(86) 9-9787-1994"], ["updated_at", "2018-06-08 17:02:54.825428"], ["id", 18]]
---
  def update
    respond_to do |format|
      if @aluno.update(aluno_params)

DELETE FROM "alunos" WHERE "alunos"."id" = ?  [["id", 47]]
---
  def destroy
    @aluno.destroy

SELECT  "alunos".* FROM "alunos" WHERE "alunos"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
---
    def set_aluno
      @aluno = Aluno.find(params[:id])