app/controllers/emprestimos_controller.rb

SELECT  "alunos".* FROM "alunos" WHERE "alunos"."matricula" = ? ORDER BY "alunos"."id" ASC LIMIT ?  [["matricula", 1059664], ["LIMIT", 1]]
SELECT  1 AS one FROM "alunos" WHERE "alunos"."matricula" = ? LIMIT ?  [["matricula", 1059664], ["LIMIT", 1]]
SELECT  "livros".* FROM "livros" WHERE "livros"."codigo" = ? ORDER BY "livros"."id" ASC LIMIT ?  [["codigo", 8002577], ["LIMIT", 1]]
SELECT  1 AS one FROM "livros" WHERE "livros"."codigo" = ? LIMIT ?  [["codigo", 8002577], ["LIMIT", 1]]
UPDATE "emprestimos" SET "aluno_id" = ?, "livro_id" = ?, "updated_at" = ? WHERE "emprestimos"."id" = ?  [["aluno_id", 8], ["livro_id", 8], ["updated_at", "2018-06-10 23:32:15.535729"], ["id", 51]]
---
  def update
    respond_to do |format|
       # Se aluno não existe não banco dados ou um livro uma messagem informativa e lançada para o usuario
       if !Aluno.where(matricula: @emprestimo.matricula).exists?
        format.html { redirect_to new_emprestimo_path, alert: "Matricula incorreta ou não cadastrada." }
        format.json { head :no_content }
      elsif !Livro.where(codigo: @emprestimo.codigo).exists?
        format.html { redirect_to new_emprestimo_path, alert: "Codigo incorreto ou não cadastrado." }
        format.json { head :no_content }
      elsif @emprestimo.data_devoluncao.nil?
        format.html { redirect_to new_emprestimo_path, alert: "Selecione uma data para devolução." }
        format.json { head :no_content }
      else
        # Pesquisa no banco da dados aluno e livro com o numero da matricula do aluno e codigo do livro
        aluno = Aluno.where(matricula: @emprestimo.matricula).first
        livro = Livro.where(codigo: @emprestimo.codigo).first

        # Emprestimo aluno e livro recebe os valores do aluno nome e livro titulo e data do emprestimo receber data atual
        @emprestimo.aluno_nome = aluno.nome
        @emprestimo.livro_titulo = livro.titulo
        @emprestimo.data_emprestimo = Time.now.strftime("%Y-%m-%d")
        @emprestimo.aluno = aluno
        @emprestimo.livro = livro

        if @emprestimo.update(emprestimo_params)

DELETE FROM "emprestimos" WHERE "emprestimos"."id" = ?  [["id", 52]]
---
  def destroy
    @emprestimo.destroy

SELECT  "emprestimos".* FROM "emprestimos" WHERE "emprestimos"."id" = ? LIMIT ?  [["id", 50], ["LIMIT", 1]]
---
    def set_emprestimo
      @emprestimo = Emprestimo.find(params[:id])