app/controllers/emprestimos_controller.rb

INSERT INTO "emprestimos" ("aluno", "matricula", "livro", "codigo", "data_emprestimo", "data_devoluncao", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @emprestimo = Emprestimo.new(emprestimo_params)

    respond_to do |format|
      if validar_dados(@emprestimo)
        format.html { redirect_to new_emprestimo_path, alert: @error }
        format.json { head :no_content }
      else
        finalizar_dados(@emprestimo)
        if @emprestimo.save

DELETE FROM "emprestimos" WHERE "emprestimos"."id" = ?  [["id", 28]]
---
  def destroy
    @emprestimo.destroy

SELECT  "emprestimos".* FROM "emprestimos" WHERE "emprestimos"."id" = ? LIMIT ?  [["id", 28], ["LIMIT", 1]]
---
    def set_emprestimo
      @emprestimo = Emprestimo.find(params[:id])