app/controllers/emprestimos_controller.rb

SELECT  "emprestimos".* FROM "emprestimos" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "emprestimos"
---
  def index
    @emprestimos = Emprestimo.all.page params[:page]

SELECT  "alunos".* FROM "alunos" WHERE "alunos"."matricula" = ? ORDER BY "alunos"."id" ASC LIMIT ?  [["matricula", 11111], ["LIMIT", 1]]
SELECT  1 AS one FROM "alunos" WHERE "alunos"."matricula" = ? LIMIT ?  [["matricula", 98298928982], ["LIMIT", 1]]
SELECT  "livros".* FROM "livros" WHERE "livros"."codigo" = ? ORDER BY "livros"."id" ASC LIMIT ?  [["codigo", 452744], ["LIMIT", 1]]
SELECT  1 AS one FROM "alunos" WHERE "alunos"."matricula" = ? LIMIT ?  [["matricula", 1059664], ["LIMIT", 1]]
SELECT  1 AS one FROM "livros" WHERE "livros"."codigo" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT  "alunos".* FROM "alunos" WHERE "alunos"."matricula" = ? ORDER BY "alunos"."id" ASC LIMIT ?  [["matricula", 11111111], ["LIMIT", 1]]
INSERT INTO "emprestimos" ("aluno", "matricula", "livro", "codigo", "data_emprestimo", "data_devoluncao", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @emprestimo = Emprestimo.new(emprestimo_params)

    respond_to do |format|
      # Se aluno não existe não banco dados ou um livro uma messagem informativa e lançada para o usuario
      if !Aluno.where(matricula: @emprestimo.matricula).exists?
        format.html { redirect_to new_emprestimo_path, alert: "Matricula incorreta ou não cadastrada." }
        format.json { head :no_content }
      elsif !Livro.where(codigo: @emprestimo.codigo).exists?
        format.html { redirect_to new_emprestimo_path, alert: "Codigo incorreto ou não cadastrado." }
        format.json { head :no_content }
      elsif @emprestimo.data_devoluncao.nil?
        format.html { redirect_to new_emprestimo_path, alert: "Selecione uma data para devolução." }
        format.json { head :no_content }
      else
        # Pesquisa no banco da dados aluno e livro com o numero da matricula do aluno e codigo do livro
        aluno = Aluno.where(matricula: @emprestimo.matricula).first
        livro = Livro.where(codigo: @emprestimo.codigo).first

        # Emprestimo aluno e livro recebe os valores do aluno nome e livro titulo e data do emprestimo receber data atual
        @emprestimo.aluno = aluno.nome
        @emprestimo.livro = livro.titulo
        @emprestimo.data_emprestimo = Time.now.strftime("%Y-%m-%d")

        if @emprestimo.save

UPDATE "emprestimos" SET "livro" = ?, "updated_at" = ? WHERE "emprestimos"."id" = ?  [["livro", "A Segunda Guerra Mundial - Os 2174 Dias Que Mudaram o Mundo"], ["updated_at", "2018-06-08 17:25:05.232052"], ["id", 54]]
---
  def update
    respond_to do |format|
      if @emprestimo.update(emprestimo_params)

DELETE FROM "emprestimos" WHERE "emprestimos"."id" = ?  [["id", 54]]
---
  def destroy
    @emprestimo.destroy

SELECT  "emprestimos".* FROM "emprestimos" WHERE "emprestimos"."id" = ? LIMIT ?  [["id", 49], ["LIMIT", 1]]
---
    def set_emprestimo
      @emprestimo = Emprestimo.find(params[:id])