app/controllers/livros_controller.rb

  def index
    @livros = Livro.all.page params[:page]
---
SELECT  "livros".* FROM "livros" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "livros"

  def create
    @livro = Livro.new(livro_params)

    respond_to do |format|
       #Verifica se todos os campos foram prenchido
       if @livro.titulo.empty? || @livro.codigo.nil? || @livro.autor.empty?
        format.html { redirect_to new_livro_path, alert: "Todos os campos devem ser preenchido." }
        format.json { head :no_content }
      #Verifica se a matricula esta correta
      elsif @livro.codigo.digits.count < 6
        format.html { redirect_to new_livro_path, alert: "Codigo incorreta." }
        format.json { head :no_content }
      #Verifica se o aluno já esta cadastrado
      elsif Livro.where(codigo: @livro.codigo).exists?
        format.html { redirect_to new_livro_path, alert: "Livro já cadastrado no sistema." }
        format.json { head :no_content }
      else
        if @livro.save
---
SELECT  1 AS one FROM "livros" WHERE "livros"."codigo" = ? LIMIT ?  [["codigo", 452744], ["LIMIT", 1]]
UPDATE "livros" SET "titulo" = ?, "updated_at" = ? WHERE "livros"."id" = ?  [["titulo", "O Senhor dos Anéis II - As Duas Torres"], ["updated_at", "2018-06-03 18:26:55.051271"], ["id", 2]]
INSERT INTO "livros" ("titulo", "autor", "codigo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["titulo", "qwqwqwqwqw"], ["autor", "qwqwq"], ["codigo", 1234567], ["created_at", "2018-06-08 17:46:21.164905"], ["updated_at", "2018-06-08 17:46:21.164905"]]

  def update
    respond_to do |format|
      if @livro.update(livro_params)
---
UPDATE "livros" SET "titulo" = ?, "updated_at" = ? WHERE "livros"."id" = ?  [["titulo", "O Senhor dos Anéis II - As Duas Torres"], ["updated_at", "2018-06-03 18:26:55.051271"], ["id", 2]]

    def set_livro
      @livro = Livro.find(params[:id])
---
SELECT  "livros".* FROM "livros" WHERE "livros"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]